export const startMsg =
  'Привіт!\n' +
  "Я асистент <b><a href='https://ccblog.com.ua/'>Chaos chronicle blog</a></b>.\n\n" +
  "Моя мета допомогти Вам у вирішенні питань пов'язаних з роботою сайту.\n\n" +
  'Перш ніж почати, рекомендую скористатись командою <b>/help</b>.';

export const helpMsg =
  'Блог <b>CHAOS CHRONICLES</b> - це платформа, де українці мають можливість поділитися своїми історіями та досвідом переживання війни, що триває в Україні.\n\n' +
  'Якщо у Вас:\n' +
  '   &#8226; виникли технічні проблеми\n' +
  "   &#8226; з'явились цікаві пропозиції\n" +
  '   &#8226; виникло бажання долучитись до нашої команди,\n' +
  'будь ласка, напишіть звернення в цьому чаті.\n\n' +
  'Для отримання інструкцій щодо:\n' +
  '   &#8226; авторизації &#8594; /authorization\n' +
  '   &#8226; реєстрації &#8594; /registration\n' +
  '   &#8226; додавання статей &#8594; /addArticle\n' +
  '   &#8226; системи рейтингу &#8594; /rating\n\n' +
  'Ми розуміємо, що ваш час дуже цінний, тому зробимо все можливе, щоб якнайшвидше та якнайбільш ефективно відповісти на Ваш запит.\n\n' +
  'Дякуємо за використання нашого сервісу і сподіваємося на продуктивну співпрацю з Вами!';

export const authMsg =
  "Для <b>авторизації</b> на <a href='https://ccblog.com.ua/'>Chaos Chronicle</a> необхідно:\n" +
  "   1. Перейти на <a href='https://ccblog.com.ua/'>сайт</a>.\n" +
  '   2. У верхньому правому куті сайту натиснути <b>Авторизація</b>.\n' +
  '   3. Ввести E-mail та відповідний пароль.\n' +
  '   4. Натиснути <b>Вхід</b>.\n\n' +
  'Якщо Ви не зареєстровані на сайті, будь ласка, ознайомтесь із процедурою реєстрації &#8594; /registration.\n\n' +
  'Якщо Вам не вдалось авторизуватись, просто напишіть нам в цьому чаті, і ми із задоволенням допоможемо.';

export const registrationMsg =
  "Для <b>реєстрації</b> на <a href='https://ccblog.com.ua/'>Chaos Chronicle</a> необхідно:\n" +
  "   1. Перейти на сторінку реєстрації &#8594; <a href='https://ccblog.com.ua/registration'>реєстрація</a>.\n" +
  "   2. Ввести Ім'я, E-mail та пароль.\n" +
  '   3. Рекомендуємо додати фото або зображення (аватар) для Вашого профілю <i>(розмір зображення не може перевищувати 100кБ)</i>.\n' +
  '   4. Натиснути <b>Реєстрація</b>.\n' +
  '   5. На Вашу електронну пошту надійде повідомлення із посиланням для підтвердежння облікового запису - натисніть "ПІДТВЕРДИТИ".\n\n' +
  "Вітаємо, тепер Ви зареєстровані на <a href='https://ccblog.com.ua/'>Chaos Chronicle</a> і можете додавати та коментувати статті.\n\n" +
  '<b>УВАГА!</b> Якщо Ви не підтвердили свою електронну пошту, ваш обліковий запис буде видалено через добу. Це зроблено з метою запобігання зловмисним діям та підвищення безпеки.';

export const addArticleMsg =
  "Для <b>додавання статті</b> на <a href='https://ccblog.com.ua/'>Chaos Chronicle</a> необхідно:\n" +
  '   1. Авторизуватись на сайті. Як авторизуватись &#8594; /authorization.\n' +
  '   2. У верхньому правому куті сайту натиснути <b>Нова стаття</b>.\n' +
  '   3. Ознайомитись із порадами щодо написання статей на сторінці додавання статті.\n' +
  '   4. Завантажити обкладинку для статті, додати заголовок та текст статті. Також рекомендуємо вказати ключові слова (теги) для підвищення ефективності пошуку Вашої статті іншими користувачами.\n' +
  '   5. Натиснути <b>Опублікувати</b>.\n\n' +
  "Вітаємо, Вашу статтю опубліковано на <a href='https://ccblog.com.ua/'>Chaos Chronicle</a>.\n\n" +
  '<b>УВАГА!</b> Не використовуйте статті інших авторів.';

export const ratingMsg =
  "Блог <a href='https://ccblog.com.ua/'>Chaos Chronicle</a> використовує дуже просту систему оцінювання активності авторів:\n" +
  '   1. За кожну додану статтю автор отримує 10 балів до свого рейтингу активності.\n' +
  '   2. За кожен коментар автор отримує 1 бал до свого рейтингу активності.\n' +
  '   3. Також, автори можуть отримати підвищення рейтингу за додаткову активність.\n\n' +
  "Рейтинг активності впливає на черговість відображення авторів на сторінці <a href='https://ccblog.com.ua/authors'>Активні користувачі</a>.";
